{
  "token_to_id": {
    "<PAD>": 0,
    "<BOS>": 1,
    "<EOS>": 2,
    "<UNK>": 3,
    "NOTE_ON_0": 4,
    "NOTE_ON_1": 5,
    "NOTE_ON_2": 6,
    "NOTE_ON_3": 7,
    "NOTE_ON_4": 8,
    "NOTE_ON_5": 9,
    "NOTE_ON_6": 10,
    "NOTE_ON_7": 11,
    "NOTE_ON_8": 12,
    "NOTE_ON_9": 13,
    "NOTE_ON_10": 14,
    "NOTE_ON_11": 15,
    "NOTE_ON_12": 16,
    "NOTE_ON_13": 17,
    "NOTE_ON_14": 18,
    "NOTE_ON_15": 19,
    "NOTE_ON_16": 20,
    "NOTE_ON_17": 21,
    "NOTE_ON_18": 22,
    "NOTE_ON_19": 23,
    "NOTE_ON_20": 24,
    "NOTE_ON_21": 25,
    "NOTE_ON_22": 26,
    "NOTE_ON_23": 27,
    "NOTE_ON_24": 28,
    "NOTE_ON_25": 29,
    "NOTE_ON_26": 30,
    "NOTE_ON_27": 31,
    "NOTE_ON_28": 32,
    "NOTE_ON_29": 33,
    "NOTE_ON_30": 34,
    "NOTE_ON_31": 35,
    "NOTE_ON_32": 36,
    "NOTE_ON_33": 37,
    "NOTE_ON_34": 38,
    "NOTE_ON_35": 39,
    "NOTE_ON_36": 40,
    "NOTE_ON_37": 41,
    "NOTE_ON_38": 42,
    "NOTE_ON_39": 43,
    "NOTE_ON_40": 44,
    "NOTE_ON_41": 45,
    "NOTE_ON_42": 46,
    "NOTE_ON_43": 47,
    "NOTE_ON_44": 48,
    "NOTE_ON_45": 49,
    "NOTE_ON_46": 50,
    "NOTE_ON_47": 51,
    "NOTE_ON_48": 52,
    "NOTE_ON_49": 53,
    "NOTE_ON_50": 54,
    "NOTE_ON_51": 55,
    "NOTE_ON_52": 56,
    "NOTE_ON_53": 57,
    "NOTE_ON_54": 58,
    "NOTE_ON_55": 59,
    "NOTE_ON_56": 60,
    "NOTE_ON_57": 61,
    "NOTE_ON_58": 62,
    "NOTE_ON_59": 63,
    "NOTE_ON_60": 64,
    "NOTE_ON_61": 65,
    "NOTE_ON_62": 66,
    "NOTE_ON_63": 67,
    "NOTE_ON_64": 68,
    "NOTE_ON_65": 69,
    "NOTE_ON_66": 70,
    "NOTE_ON_67": 71,
    "NOTE_ON_68": 72,
    "NOTE_ON_69": 73,
    "NOTE_ON_70": 74,
    "NOTE_ON_71": 75,
    "NOTE_ON_72": 76,
    "NOTE_ON_73": 77,
    "NOTE_ON_74": 78,
    "NOTE_ON_75": 79,
    "NOTE_ON_76": 80,
    "NOTE_ON_77": 81,
    "NOTE_ON_78": 82,
    "NOTE_ON_79": 83,
    "NOTE_ON_80": 84,
    "NOTE_ON_81": 85,
    "NOTE_ON_82": 86,
    "NOTE_ON_83": 87,
    "NOTE_ON_84": 88,
    "NOTE_ON_85": 89,
    "NOTE_ON_86": 90,
    "NOTE_ON_87": 91,
    "NOTE_ON_88": 92,
    "NOTE_ON_89": 93,
    "NOTE_ON_90": 94,
    "NOTE_ON_91": 95,
    "NOTE_ON_92": 96,
    "NOTE_ON_93": 97,
    "NOTE_ON_94": 98,
    "NOTE_ON_95": 99,
    "NOTE_ON_96": 100,
    "NOTE_ON_97": 101,
    "NOTE_ON_98": 102,
    "NOTE_ON_99": 103,
    "NOTE_ON_100": 104,
    "NOTE_ON_101": 105,
    "NOTE_ON_102": 106,
    "NOTE_ON_103": 107,
    "NOTE_ON_104": 108,
    "NOTE_ON_105": 109,
    "NOTE_ON_106": 110,
    "NOTE_ON_107": 111,
    "NOTE_ON_108": 112,
    "NOTE_ON_109": 113,
    "NOTE_ON_110": 114,
    "NOTE_ON_111": 115,
    "NOTE_ON_112": 116,
    "NOTE_ON_113": 117,
    "NOTE_ON_114": 118,
    "NOTE_ON_115": 119,
    "NOTE_ON_116": 120,
    "NOTE_ON_117": 121,
    "NOTE_ON_118": 122,
    "NOTE_ON_119": 123,
    "NOTE_ON_120": 124,
    "NOTE_ON_121": 125,
    "NOTE_ON_122": 126,
    "NOTE_ON_123": 127,
    "NOTE_ON_124": 128,
    "NOTE_ON_125": 129,
    "NOTE_ON_126": 130,
    "NOTE_ON_127": 131,
    "NOTE_OFF_0": 132,
    "NOTE_OFF_1": 133,
    "NOTE_OFF_2": 134,
    "NOTE_OFF_3": 135,
    "NOTE_OFF_4": 136,
    "NOTE_OFF_5": 137,
    "NOTE_OFF_6": 138,
    "NOTE_OFF_7": 139,
    "NOTE_OFF_8": 140,
    "NOTE_OFF_9": 141,
    "NOTE_OFF_10": 142,
    "NOTE_OFF_11": 143,
    "NOTE_OFF_12": 144,
    "NOTE_OFF_13": 145,
    "NOTE_OFF_14": 146,
    "NOTE_OFF_15": 147,
    "NOTE_OFF_16": 148,
    "NOTE_OFF_17": 149,
    "NOTE_OFF_18": 150,
    "NOTE_OFF_19": 151,
    "NOTE_OFF_20": 152,
    "NOTE_OFF_21": 153,
    "NOTE_OFF_22": 154,
    "NOTE_OFF_23": 155,
    "NOTE_OFF_24": 156,
    "NOTE_OFF_25": 157,
    "NOTE_OFF_26": 158,
    "NOTE_OFF_27": 159,
    "NOTE_OFF_28": 160,
    "NOTE_OFF_29": 161,
    "NOTE_OFF_30": 162,
    "NOTE_OFF_31": 163,
    "NOTE_OFF_32": 164,
    "NOTE_OFF_33": 165,
    "NOTE_OFF_34": 166,
    "NOTE_OFF_35": 167,
    "NOTE_OFF_36": 168,
    "NOTE_OFF_37": 169,
    "NOTE_OFF_38": 170,
    "NOTE_OFF_39": 171,
    "NOTE_OFF_40": 172,
    "NOTE_OFF_41": 173,
    "NOTE_OFF_42": 174,
    "NOTE_OFF_43": 175,
    "NOTE_OFF_44": 176,
    "NOTE_OFF_45": 177,
    "NOTE_OFF_46": 178,
    "NOTE_OFF_47": 179,
    "NOTE_OFF_48": 180,
    "NOTE_OFF_49": 181,
    "NOTE_OFF_50": 182,
    "NOTE_OFF_51": 183,
    "NOTE_OFF_52": 184,
    "NOTE_OFF_53": 185,
    "NOTE_OFF_54": 186,
    "NOTE_OFF_55": 187,
    "NOTE_OFF_56": 188,
    "NOTE_OFF_57": 189,
    "NOTE_OFF_58": 190,
    "NOTE_OFF_59": 191,
    "NOTE_OFF_60": 192,
    "NOTE_OFF_61": 193,
    "NOTE_OFF_62": 194,
    "NOTE_OFF_63": 195,
    "NOTE_OFF_64": 196,
    "NOTE_OFF_65": 197,
    "NOTE_OFF_66": 198,
    "NOTE_OFF_67": 199,
    "NOTE_OFF_68": 200,
    "NOTE_OFF_69": 201,
    "NOTE_OFF_70": 202,
    "NOTE_OFF_71": 203,
    "NOTE_OFF_72": 204,
    "NOTE_OFF_73": 205,
    "NOTE_OFF_74": 206,
    "NOTE_OFF_75": 207,
    "NOTE_OFF_76": 208,
    "NOTE_OFF_77": 209,
    "NOTE_OFF_78": 210,
    "NOTE_OFF_79": 211,
    "NOTE_OFF_80": 212,
    "NOTE_OFF_81": 213,
    "NOTE_OFF_82": 214,
    "NOTE_OFF_83": 215,
    "NOTE_OFF_84": 216,
    "NOTE_OFF_85": 217,
    "NOTE_OFF_86": 218,
    "NOTE_OFF_87": 219,
    "NOTE_OFF_88": 220,
    "NOTE_OFF_89": 221,
    "NOTE_OFF_90": 222,
    "NOTE_OFF_91": 223,
    "NOTE_OFF_92": 224,
    "NOTE_OFF_93": 225,
    "NOTE_OFF_94": 226,
    "NOTE_OFF_95": 227,
    "NOTE_OFF_96": 228,
    "NOTE_OFF_97": 229,
    "NOTE_OFF_98": 230,
    "NOTE_OFF_99": 231,
    "NOTE_OFF_100": 232,
    "NOTE_OFF_101": 233,
    "NOTE_OFF_102": 234,
    "NOTE_OFF_103": 235,
    "NOTE_OFF_104": 236,
    "NOTE_OFF_105": 237,
    "NOTE_OFF_106": 238,
    "NOTE_OFF_107": 239,
    "NOTE_OFF_108": 240,
    "NOTE_OFF_109": 241,
    "NOTE_OFF_110": 242,
    "NOTE_OFF_111": 243,
    "NOTE_OFF_112": 244,
    "NOTE_OFF_113": 245,
    "NOTE_OFF_114": 246,
    "NOTE_OFF_115": 247,
    "NOTE_OFF_116": 248,
    "NOTE_OFF_117": 249,
    "NOTE_OFF_118": 250,
    "NOTE_OFF_119": 251,
    "NOTE_OFF_120": 252,
    "NOTE_OFF_121": 253,
    "NOTE_OFF_122": 254,
    "NOTE_OFF_123": 255,
    "NOTE_OFF_124": 256,
    "NOTE_OFF_125": 257,
    "NOTE_OFF_126": 258,
    "NOTE_OFF_127": 259,
    "TIME_SHIFT_1": 260,
    "TIME_SHIFT_2": 261,
    "TIME_SHIFT_3": 262,
    "TIME_SHIFT_4": 263,
    "TIME_SHIFT_5": 264,
    "TIME_SHIFT_6": 265,
    "TIME_SHIFT_7": 266,
    "TIME_SHIFT_8": 267,
    "TIME_SHIFT_9": 268,
    "TIME_SHIFT_10": 269,
    "TIME_SHIFT_11": 270,
    "TIME_SHIFT_12": 271,
    "TIME_SHIFT_13": 272,
    "TIME_SHIFT_14": 273,
    "TIME_SHIFT_15": 274,
    "TIME_SHIFT_16": 275,
    "TIME_SHIFT_17": 276,
    "TIME_SHIFT_18": 277,
    "TIME_SHIFT_19": 278,
    "TIME_SHIFT_20": 279,
    "TIME_SHIFT_21": 280,
    "TIME_SHIFT_22": 281,
    "TIME_SHIFT_23": 282,
    "TIME_SHIFT_24": 283,
    "TIME_SHIFT_25": 284,
    "TIME_SHIFT_26": 285,
    "TIME_SHIFT_27": 286,
    "TIME_SHIFT_28": 287,
    "TIME_SHIFT_29": 288,
    "TIME_SHIFT_30": 289,
    "TIME_SHIFT_31": 290,
    "TIME_SHIFT_32": 291,
    "VELOCITY_1": 292,
    "VELOCITY_2": 293,
    "VELOCITY_3": 294,
    "VELOCITY_4": 295,
    "VELOCITY_5": 296,
    "VELOCITY_6": 297,
    "VELOCITY_7": 298,
    "VELOCITY_8": 299,
    "DURATION_1": 300,
    "DURATION_2": 301,
    "DURATION_3": 302,
    "DURATION_4": 303,
    "DURATION_5": 304,
    "DURATION_6": 305,
    "DURATION_7": 306,
    "DURATION_8": 307,
    "DURATION_9": 308,
    "DURATION_10": 309,
    "DURATION_11": 310,
    "DURATION_12": 311,
    "DURATION_13": 312,
    "DURATION_14": 313,
    "DURATION_15": 314,
    "DURATION_16": 315
  },
  "id_to_token": {
    "0": "<PAD>",
    "1": "<BOS>",
    "2": "<EOS>",
    "3": "<UNK>",
    "4": "NOTE_ON_0",
    "5": "NOTE_ON_1",
    "6": "NOTE_ON_2",
    "7": "NOTE_ON_3",
    "8": "NOTE_ON_4",
    "9": "NOTE_ON_5",
    "10": "NOTE_ON_6",
    "11": "NOTE_ON_7",
    "12": "NOTE_ON_8",
    "13": "NOTE_ON_9",
    "14": "NOTE_ON_10",
    "15": "NOTE_ON_11",
    "16": "NOTE_ON_12",
    "17": "NOTE_ON_13",
    "18": "NOTE_ON_14",
    "19": "NOTE_ON_15",
    "20": "NOTE_ON_16",
    "21": "NOTE_ON_17",
    "22": "NOTE_ON_18",
    "23": "NOTE_ON_19",
    "24": "NOTE_ON_20",
    "25": "NOTE_ON_21",
    "26": "NOTE_ON_22",
    "27": "NOTE_ON_23",
    "28": "NOTE_ON_24",
    "29": "NOTE_ON_25",
    "30": "NOTE_ON_26",
    "31": "NOTE_ON_27",
    "32": "NOTE_ON_28",
    "33": "NOTE_ON_29",
    "34": "NOTE_ON_30",
    "35": "NOTE_ON_31",
    "36": "NOTE_ON_32",
    "37": "NOTE_ON_33",
    "38": "NOTE_ON_34",
    "39": "NOTE_ON_35",
    "40": "NOTE_ON_36",
    "41": "NOTE_ON_37",
    "42": "NOTE_ON_38",
    "43": "NOTE_ON_39",
    "44": "NOTE_ON_40",
    "45": "NOTE_ON_41",
    "46": "NOTE_ON_42",
    "47": "NOTE_ON_43",
    "48": "NOTE_ON_44",
    "49": "NOTE_ON_45",
    "50": "NOTE_ON_46",
    "51": "NOTE_ON_47",
    "52": "NOTE_ON_48",
    "53": "NOTE_ON_49",
    "54": "NOTE_ON_50",
    "55": "NOTE_ON_51",
    "56": "NOTE_ON_52",
    "57": "NOTE_ON_53",
    "58": "NOTE_ON_54",
    "59": "NOTE_ON_55",
    "60": "NOTE_ON_56",
    "61": "NOTE_ON_57",
    "62": "NOTE_ON_58",
    "63": "NOTE_ON_59",
    "64": "NOTE_ON_60",
    "65": "NOTE_ON_61",
    "66": "NOTE_ON_62",
    "67": "NOTE_ON_63",
    "68": "NOTE_ON_64",
    "69": "NOTE_ON_65",
    "70": "NOTE_ON_66",
    "71": "NOTE_ON_67",
    "72": "NOTE_ON_68",
    "73": "NOTE_ON_69",
    "74": "NOTE_ON_70",
    "75": "NOTE_ON_71",
    "76": "NOTE_ON_72",
    "77": "NOTE_ON_73",
    "78": "NOTE_ON_74",
    "79": "NOTE_ON_75",
    "80": "NOTE_ON_76",
    "81": "NOTE_ON_77",
    "82": "NOTE_ON_78",
    "83": "NOTE_ON_79",
    "84": "NOTE_ON_80",
    "85": "NOTE_ON_81",
    "86": "NOTE_ON_82",
    "87": "NOTE_ON_83",
    "88": "NOTE_ON_84",
    "89": "NOTE_ON_85",
    "90": "NOTE_ON_86",
    "91": "NOTE_ON_87",
    "92": "NOTE_ON_88",
    "93": "NOTE_ON_89",
    "94": "NOTE_ON_90",
    "95": "NOTE_ON_91",
    "96": "NOTE_ON_92",
    "97": "NOTE_ON_93",
    "98": "NOTE_ON_94",
    "99": "NOTE_ON_95",
    "100": "NOTE_ON_96",
    "101": "NOTE_ON_97",
    "102": "NOTE_ON_98",
    "103": "NOTE_ON_99",
    "104": "NOTE_ON_100",
    "105": "NOTE_ON_101",
    "106": "NOTE_ON_102",
    "107": "NOTE_ON_103",
    "108": "NOTE_ON_104",
    "109": "NOTE_ON_105",
    "110": "NOTE_ON_106",
    "111": "NOTE_ON_107",
    "112": "NOTE_ON_108",
    "113": "NOTE_ON_109",
    "114": "NOTE_ON_110",
    "115": "NOTE_ON_111",
    "116": "NOTE_ON_112",
    "117": "NOTE_ON_113",
    "118": "NOTE_ON_114",
    "119": "NOTE_ON_115",
    "120": "NOTE_ON_116",
    "121": "NOTE_ON_117",
    "122": "NOTE_ON_118",
    "123": "NOTE_ON_119",
    "124": "NOTE_ON_120",
    "125": "NOTE_ON_121",
    "126": "NOTE_ON_122",
    "127": "NOTE_ON_123",
    "128": "NOTE_ON_124",
    "129": "NOTE_ON_125",
    "130": "NOTE_ON_126",
    "131": "NOTE_ON_127",
    "132": "NOTE_OFF_0",
    "133": "NOTE_OFF_1",
    "134": "NOTE_OFF_2",
    "135": "NOTE_OFF_3",
    "136": "NOTE_OFF_4",
    "137": "NOTE_OFF_5",
    "138": "NOTE_OFF_6",
    "139": "NOTE_OFF_7",
    "140": "NOTE_OFF_8",
    "141": "NOTE_OFF_9",
    "142": "NOTE_OFF_10",
    "143": "NOTE_OFF_11",
    "144": "NOTE_OFF_12",
    "145": "NOTE_OFF_13",
    "146": "NOTE_OFF_14",
    "147": "NOTE_OFF_15",
    "148": "NOTE_OFF_16",
    "149": "NOTE_OFF_17",
    "150": "NOTE_OFF_18",
    "151": "NOTE_OFF_19",
    "152": "NOTE_OFF_20",
    "153": "NOTE_OFF_21",
    "154": "NOTE_OFF_22",
    "155": "NOTE_OFF_23",
    "156": "NOTE_OFF_24",
    "157": "NOTE_OFF_25",
    "158": "NOTE_OFF_26",
    "159": "NOTE_OFF_27",
    "160": "NOTE_OFF_28",
    "161": "NOTE_OFF_29",
    "162": "NOTE_OFF_30",
    "163": "NOTE_OFF_31",
    "164": "NOTE_OFF_32",
    "165": "NOTE_OFF_33",
    "166": "NOTE_OFF_34",
    "167": "NOTE_OFF_35",
    "168": "NOTE_OFF_36",
    "169": "NOTE_OFF_37",
    "170": "NOTE_OFF_38",
    "171": "NOTE_OFF_39",
    "172": "NOTE_OFF_40",
    "173": "NOTE_OFF_41",
    "174": "NOTE_OFF_42",
    "175": "NOTE_OFF_43",
    "176": "NOTE_OFF_44",
    "177": "NOTE_OFF_45",
    "178": "NOTE_OFF_46",
    "179": "NOTE_OFF_47",
    "180": "NOTE_OFF_48",
    "181": "NOTE_OFF_49",
    "182": "NOTE_OFF_50",
    "183": "NOTE_OFF_51",
    "184": "NOTE_OFF_52",
    "185": "NOTE_OFF_53",
    "186": "NOTE_OFF_54",
    "187": "NOTE_OFF_55",
    "188": "NOTE_OFF_56",
    "189": "NOTE_OFF_57",
    "190": "NOTE_OFF_58",
    "191": "NOTE_OFF_59",
    "192": "NOTE_OFF_60",
    "193": "NOTE_OFF_61",
    "194": "NOTE_OFF_62",
    "195": "NOTE_OFF_63",
    "196": "NOTE_OFF_64",
    "197": "NOTE_OFF_65",
    "198": "NOTE_OFF_66",
    "199": "NOTE_OFF_67",
    "200": "NOTE_OFF_68",
    "201": "NOTE_OFF_69",
    "202": "NOTE_OFF_70",
    "203": "NOTE_OFF_71",
    "204": "NOTE_OFF_72",
    "205": "NOTE_OFF_73",
    "206": "NOTE_OFF_74",
    "207": "NOTE_OFF_75",
    "208": "NOTE_OFF_76",
    "209": "NOTE_OFF_77",
    "210": "NOTE_OFF_78",
    "211": "NOTE_OFF_79",
    "212": "NOTE_OFF_80",
    "213": "NOTE_OFF_81",
    "214": "NOTE_OFF_82",
    "215": "NOTE_OFF_83",
    "216": "NOTE_OFF_84",
    "217": "NOTE_OFF_85",
    "218": "NOTE_OFF_86",
    "219": "NOTE_OFF_87",
    "220": "NOTE_OFF_88",
    "221": "NOTE_OFF_89",
    "222": "NOTE_OFF_90",
    "223": "NOTE_OFF_91",
    "224": "NOTE_OFF_92",
    "225": "NOTE_OFF_93",
    "226": "NOTE_OFF_94",
    "227": "NOTE_OFF_95",
    "228": "NOTE_OFF_96",
    "229": "NOTE_OFF_97",
    "230": "NOTE_OFF_98",
    "231": "NOTE_OFF_99",
    "232": "NOTE_OFF_100",
    "233": "NOTE_OFF_101",
    "234": "NOTE_OFF_102",
    "235": "NOTE_OFF_103",
    "236": "NOTE_OFF_104",
    "237": "NOTE_OFF_105",
    "238": "NOTE_OFF_106",
    "239": "NOTE_OFF_107",
    "240": "NOTE_OFF_108",
    "241": "NOTE_OFF_109",
    "242": "NOTE_OFF_110",
    "243": "NOTE_OFF_111",
    "244": "NOTE_OFF_112",
    "245": "NOTE_OFF_113",
    "246": "NOTE_OFF_114",
    "247": "NOTE_OFF_115",
    "248": "NOTE_OFF_116",
    "249": "NOTE_OFF_117",
    "250": "NOTE_OFF_118",
    "251": "NOTE_OFF_119",
    "252": "NOTE_OFF_120",
    "253": "NOTE_OFF_121",
    "254": "NOTE_OFF_122",
    "255": "NOTE_OFF_123",
    "256": "NOTE_OFF_124",
    "257": "NOTE_OFF_125",
    "258": "NOTE_OFF_126",
    "259": "NOTE_OFF_127",
    "260": "TIME_SHIFT_1",
    "261": "TIME_SHIFT_2",
    "262": "TIME_SHIFT_3",
    "263": "TIME_SHIFT_4",
    "264": "TIME_SHIFT_5",
    "265": "TIME_SHIFT_6",
    "266": "TIME_SHIFT_7",
    "267": "TIME_SHIFT_8",
    "268": "TIME_SHIFT_9",
    "269": "TIME_SHIFT_10",
    "270": "TIME_SHIFT_11",
    "271": "TIME_SHIFT_12",
    "272": "TIME_SHIFT_13",
    "273": "TIME_SHIFT_14",
    "274": "TIME_SHIFT_15",
    "275": "TIME_SHIFT_16",
    "276": "TIME_SHIFT_17",
    "277": "TIME_SHIFT_18",
    "278": "TIME_SHIFT_19",
    "279": "TIME_SHIFT_20",
    "280": "TIME_SHIFT_21",
    "281": "TIME_SHIFT_22",
    "282": "TIME_SHIFT_23",
    "283": "TIME_SHIFT_24",
    "284": "TIME_SHIFT_25",
    "285": "TIME_SHIFT_26",
    "286": "TIME_SHIFT_27",
    "287": "TIME_SHIFT_28",
    "288": "TIME_SHIFT_29",
    "289": "TIME_SHIFT_30",
    "290": "TIME_SHIFT_31",
    "291": "TIME_SHIFT_32",
    "292": "VELOCITY_1",
    "293": "VELOCITY_2",
    "294": "VELOCITY_3",
    "295": "VELOCITY_4",
    "296": "VELOCITY_5",
    "297": "VELOCITY_6",
    "298": "VELOCITY_7",
    "299": "VELOCITY_8",
    "300": "DURATION_1",
    "301": "DURATION_2",
    "302": "DURATION_3",
    "303": "DURATION_4",
    "304": "DURATION_5",
    "305": "DURATION_6",
    "306": "DURATION_7",
    "307": "DURATION_8",
    "308": "DURATION_9",
    "309": "DURATION_10",
    "310": "DURATION_11",
    "311": "DURATION_12",
    "312": "DURATION_13",
    "313": "DURATION_14",
    "314": "DURATION_15",
    "315": "DURATION_16"
  },
  "config": {
    "time_shift_bins": 32,
    "velocity_bins": 8,
    "duration_bins": 16
  }
}